{
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "architectures": [
    "InformerForPrediction"
  ],
  "attention_dropout": 0.1,
  "attention_type": "prob",
  "cardinality": [
    0
  ],
  "context_length": 245,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 512,
  "decoder_layerdrop": 0.1,
  "decoder_layers": 6,
  "distil": true,
  "distribution_output": "student_t",
  "dropout": 0.05,
  "embedding_dimension": [
    0
  ],
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 512,
  "encoder_layerdrop": 0.1,
  "encoder_layers": 6,
  "feature_size": 69058,
  "init_std": 0.02,
  "input_size": 7673,
  "is_encoder_decoder": true,
  "lags_sequence": [
    1,
    2,
    3,
    4,
    5,
    6,
    7
  ],
  "loss": "nll",
  "model_type": "informer",
  "num_dynamic_real_features": 0,
  "num_parallel_samples": 100,
  "num_static_categorical_features": 0,
  "num_static_real_features": 0,
  "num_time_features": 1,
  "prediction_length": 9,
  "sampling_factor": 5,
  "scaling": "mean",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "use_cache": true
}
